Table of Contents
 Interface IIdeaCrossSection
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
A cross-section of an IIdeaElement1D.
public interface IIdeaCrossSection : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 IsInPrincipal
Specifies that the cross-section is in its principal axis.
bool IsInPrincipal { get; }
Property Value
bool
 Rotation
Rotation of the cross-section.
double Rotation { get; }
Property Value
double
 Edit this page